{
    
    "admin_oasis":{
        "title":"Admin Oasis",
        "image":"admin_oasis.png",
        "description":"El objetivo de este proyecto es centralizar la mayor parte posible de la administración y monitorización de los equipos de la empresa, así como un registro de incidencias desde una única aplicación web. De esta forma es bastante más fácil para el administrador acceder a los equipos, comprobar que funcionan correctamente y en caso de que se descubra un equipo que no está funcionando correctamente brindarle al administrador las herramientas necesarias para solucionarlo.",
        "tags":["php", "jquery","mysql","snmp","ldap","js","html","css"],
        "complexity": 3,
        "year": 2020
    },
    "q_learning_pong":{
        "title":"Q-Learning (IA) PONG",
        "image":"pong.png",
        "description":"El juego de Pong implementado con 2 agentes controlados por inteligencia artificial. Ambos agentes trabajan juntos de manera cooperativa para evitar que la pelota pase de largo. Utilizamos el algoritmo Q-Learning para entrenar a los agentes en este juego. Para la comunicacion de los agentes se ha utilizado una arquitectura cliente servidor mediante sockets TCP.",
        "tags":["python","ia","sockets"],
        "complexity": 2,
        "year": 2023
    },
    "space_simulator":{
        "title":"Simulador vuelo espacial",
        "image":"space_simulator.png",
        "description":"Simulador de vuelo utilizando C++ y OpenGL. Fisicas, iluminacion y navegacion realizadas mediante operaciones con matrices vectoriales",
        "tags":["c++","opengl"],
        "complexity": 3,
        "year": 2024
    },
     
    "planet_laser_locator":{
        "title":"Planet laser locator",
        "image":"planet_laser_locator.png",
        "description":"Proyecto desarrollado en Python y Arduino. Se consulta la API Horizons de la NASA para obtener el angulo de elevacion en el cielo y la direccion respecto a las coordenadas magneticas del cuerpo celeste elegido. Una vez obtenida esta informacion, se envia a Arduino mediante una conexion serial y mueve los motores en consecuencia",
        "tags":["python", "arduino","api"],
        "complexity": 2,
        "year": 2022
    },
    "lichess_bot":{
        "title":"Lichess BOT",
        "image":"lichess_bot.png",
        "description":"Programa desarrollado en Python y JS que juega al ajedrez de forma automatica en la plataforma lichess",
        "tags":["python", "sqlite","js","html"],
        "complexity": 2,
        "year": 2022
    }
    
}